/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jmartos- <jmartos-@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/11 19:56:39 by jmartos-          #+#    #+#             */
/*   Updated: 2024/06/11 22:22:06 by jmartos-         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "philo.h"

// FUNCIÓN DE ERROR.
void	error_and_exit(char *msg)
{
	printf(R"%s\n"RES, error);
	exit(EXIT_FAILURE);
}